# ===== 200. 岛屿数量 =====
# 难度: 中等
# 英文名: Number of Islands
# 来源: https://leetcode.cn/problems/number-of-islands/description/
#
# 给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。
#
# 岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。
#
# 此外，你可以假设该网格的四条边均被水包围。
#
#
#
# 示例 1：
#
# 输入：grid = [
# ["1","1","1","1","0"],
# ["1","1","0","1","0"],
# ["1","1","0","0","0"],
# ["0","0","0","0","0"]
# ]
# 输出：1
# 示例 2：
#
# 输入：grid = [
# ["1","1","0","0","0"],
# ["1","1","0","0","0"],
# ["0","0","1","0","0"],
# ["0","0","0","1","1"]
# ]
# 输出：3
#
#
# 提示：
#
# m == grid.length
# n == grid[i].length
# 1 <= m, n <= 300
# grid[i][j] 的值为 '0' 或 '1'
#
# ---------------------------------------------------------
def numIslands(grid):
    m, n = len(grid), len(grid[0])

    def dfs(i, j):
        if i < 0 or i >= m or j < 0 or j >= n or grid[i][j] != "1":
            return
        grid[i][j] = "2"
        dfs(i, j - 1)
        dfs(i, j + 1)
        dfs(i + 1, j)
        dfs(i - 1, j)

    ans = 0
    # for 索引，值 in 数组
    for i, row in enumerate(grid):
        for j, c in enumerate(row):
            if c == "1":
                dfs(i, j)
                ans += 1
    return ans


grid1 = [
    ["1", "1", "1", "1", "0"],
    ["1", "1", "0", "1", "0"],
    ["1", "1", "0", "0", "0"],
    ["0", "0", "0", "0", "0"],
]
print(numIslands(grid1))  # 期望输出：1

grid2 = [
    ["1", "1", "0", "0", "0"],
    ["1", "1", "0", "0", "0"],
    ["0", "0", "1", "0", "0"],
    ["0", "0", "0", "1", "1"],
]
print(numIslands(grid2))  # 期望输出：3
